IDEA Open Model
ConnectionSetup.WeldingTypeSNIP Property
Compatible with IDEA StatiCa v 10.1
 Welding types defined in SP16-Table 39
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public WeldingTypeSNIP WeldingTypeSNIP { get; set; }
Public Property WeldingTypeSNIP As WeldingTypeSNIP
	Get
	Set
public:
property WeldingTypeSNIP WeldingTypeSNIP {
	WeldingTypeSNIP get ();
	void set (WeldingTypeSNIP value);
}
Property Value
Type: WeldingTypeSNIP
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace